// Fallout 76 player stash dumper
// test Jun 17, 2020
// Version 4 - writes CSV format delimited by;
// changed column order to apply filters in Excel

// missing function to print first line of CSV
// sprintf_s ("Type; Level; Weight; Count; Item; Prefix; Maior; Minor;";
// need to manually add the first line or an external TXT
// manually add this row to CSV to import it into Excel
// Location; Type; Level; Weight; Count; Item; Perk1; Perk2; Perk3; Note1; Note2; Note3
// or paste all the text of the -CSV into an existing Excel sheet

// to do: optional printing of the ItemID
// to do: automatic search for LocalPlayerOffset and LocalSTASHOffset for new versions of Fallot76.exe

#include <fstream>
#include <iostream>
#include <Windows.h>
#include <TlHelp32.h>

HWND sHwnd = NULL;
DWORD sPid = NULL;
HANDLE sHandle = NULL;
DWORD64 sAddress = NULL;
char sWindow[] = "Fallout76";
char sModule[] = "Fallout76.exe";

// for Fallout 76 Update 1.3.3.24. (Aug-6-2020)
// Just change the local player offset to 0x05B49F78
// DWORD LocalPlayerOffset = 0x059AC798;//1.3.0.23
// DWORD LocalPlayerOffset = 0x05B49F78;//1.3.0.26
// DWORD LocalPlayerOffset = 0x05B0A458;//1.3.1.34
   DWORD LocalPlayerOffset = 0x05B45BB0;//1.3.3.24

DWORD CharacterNameOffset = 0x59A3188;//1.3.0.23
// LocalSTASHOffset in the linked source is incorrect, 0xC28 is the correct offset.
// DWORD LocalSTASHOffset = 0xC24;//1.3.0.23
   DWORD LocalSTASHOffset = 0xC28;//1.3.1.26


bool ShowNormalArmor = true;	//Non-legendary armor, requires ShowArmor to be enabled
bool ShowCharacterName = true;	//Replace [Player] with character name (if found)
bool ShowLocation = true;	//Add [Player]/[STASH]
bool ShowType = true;		//Add item type
bool ShowModifier = true;	//Add legendary modifier
bool ShowCount = true;		//Add inventory count (regular equipment/items only)
bool ShowWeight = true;		//Add item weight
bool ShowLevel = true;		//Add item level
bool ShowArmorType = true;	//Add [Light]/[Sturdy]/[Heavy] to armor
bool ShowSTASH = true;		//Include items in STASH
bool ShowEquipped = true;	//Include equipped items
bool ShowFavorited = true;	//Include favorited items
bool TargetLegendary = true;	//Set the formids for the legendary effects below, matches will be marked by [Tagged]
DWORD TargetFormid[]		//0x00000000 is skipped
{
	0x00000000,//Skipped
	0x00000000,//Skipped
	0x00000000,//Skipped
};

bool CharacterNameUpdated = false;
char CharacterName[0x300] = { '\0' };
std::ofstream InventoryStream;
size_t UnknownTracker = 0;

bool SingleKeyToggle(DWORD KeyCode, bool &KeyToggle)
{
	if (GetAsyncKeyState(KeyCode))
	{
		if (!KeyToggle)
		{
			KeyToggle = true;
			return KeyToggle;
		}
	}
	else
	{
		if (KeyToggle)
		{
			KeyToggle = false;
			return KeyToggle;
		}
	}

	return false;
}

bool DoubleKeyToggle(DWORD KeyCodeA, DWORD KeyCodeB, bool &KeyToggle)
{
	if (GetAsyncKeyState(KeyCodeA))
	{
		return SingleKeyToggle(KeyCodeB, KeyToggle);
	}

	if (GetAsyncKeyState(KeyCodeB))
	{
		return SingleKeyToggle(KeyCodeA, KeyToggle);
	}

	return false;
}

HWND GetHwnd()
{
//	printf("[Set %s as the foreground window]\n", sWindow);
//	printf("CTRL+INSERT: Get HWND of foreground window\n");

	printf("[Start %s to catch the current player]\n", sWindow);
	printf("CTRL + INSERT: press during the game, generates a TXT file with the inventory\n");

	bool SelectionKeyToggle = false;
	for (int i = 0; i < 5000; i++)
	{
		Sleep(1);
		if (DoubleKeyToggle(VK_CONTROL, VK_INSERT, SelectionKeyToggle))
		{
			system("cls");
			return GetForegroundWindow();
		}
	}

	return NULL;
}

DWORD GetPid(HWND sHwnd)
{
	DWORD pBuffer;
	GetWindowThreadProcessId(sHwnd, &pBuffer);
	return pBuffer;
}

DWORD64 GetModuleAddress64(const char *sModule, DWORD sPid)
{
	HANDLE mHandle = CreateToolhelp32Snapshot(TH32CS_SNAPMODULE, sPid);
	if (!mHandle) return NULL;

	MODULEENTRY32 mEntry;
	mEntry.dwSize = sizeof(mEntry);

	while (Module32Next(mHandle, &mEntry))
	{
		if (!strcmp(mEntry.szModule, sModule))
		{
			CloseHandle(mHandle);
			return (DWORD64)mEntry.modBaseAddr;
		}
	}

	CloseHandle(mHandle);
	return NULL;
}

HANDLE GetHandle(DWORD sPid)
{
	return OpenProcess(PROCESS_VM_READ, false, sPid);
}

bool Valid(DWORD64 ptr)
{
	if (ptr < 0x7FFF || ptr > 0x7FFFFFFFFFFF) return false;
	else return true;
}

bool RPM(HANDLE sHandle, DWORD64 src, void *dst, size_t Size)
{
	return ReadProcessMemory(sHandle, (void*)(src), dst, Size, NULL);
}

class Inventory
{
public:
	DWORD64 vtable;//0x0
	BYTE Padding0008[0x58];
	DWORD64 ItemArrayPtr;//0x60
	DWORD64 ItemArrayEnd;//0x68
};

class Item
{
public:
	DWORD64 ReferencePtr;//0x0
	char PaddingA[0x8];
	DWORD64 DescriptionPtr;//0x10
	char PaddingB[0x8];
	DWORD64 Iterations;//0x20
	unsigned char EquipFlagA;//0x28
	unsigned char EquipFlagB;//0x29
	char PaddingD[0x2];
	DWORD ItemId;//0x2C
	unsigned char FavoriteFlag;//0x30
	char PaddingE[0x3];
	float ItemWeight;//0x34
};

class ItemSize
{
public:
	DWORD64 Ptr;
	DWORD Size;
	char PaddingA[0x4];
};

class Reference
{
public:
	DWORD64 vtable;//0x0
	char PaddingA[0x10];
	unsigned char CheckA;//0x18
	char PaddingB[0x7];
	DWORD Formid;//0x20
	char PaddingC[0x1B4];
	unsigned char CheckB;//0x1D8
	char PaddingD[0x1F];
	unsigned char CheckC;//0x1F8
};

class Mod
{
public:
	DWORD64 ModListPtr;//0x0
	int ModListSize;//0x8
};

class EquipmentExtra
{
public:
	char PaddingA[0x10];
	DWORD64 ModListBufferPtr;//0x10
	unsigned char PaddingB[0x4];
	short EquipmentLevel;//0x1C
};

class OMOD
{
public:
	DWORD Flag;
	DWORD Formid;
	char Effect[0x200];
};

/*
Flag:
0x00000000 = Unused
0x00000001 = Legendary Armor Prefix
0x00000002 = Legendary Armor Major
0x00000003 = Legendary Armor Minor
0x00000004 = Legendary Weapon Prefix
0x00000005 = Legendary Weapon Major
0x00000006 = Legendary Weapon Minor
0x00000007 = Light Armor
0x00000008 = Sturdy Armor
0x00000009 = Heavy Armor
*/
OMOD ObjectModification[]
{
	{ { 0x00000001 }, { 0x00529A0F }, { "When incapacitated, gain a 50% chance to revive yourself with a Stimpak, once every minute" } },
	{ { 0x00000001 }, { 0x00524146 }, { "Blend with the environment while sneaking and not moving" } },
	{ { 0x00000001 }, { 0x00524147 }, { "Being hit in melee generates a Stealth Field once per 30 seconds" } },
	{ { 0x00000001 }, { 0x00529A09 }, { "Slowly regenerate health while not in combat" } },
	{ { 0x00000001 }, { 0x004F6D7D }, { "-15% damage from animals" } },
